Revit 2027 API
ParameterTypeId.FabricParamSheetType Property
 "Fabric Sheet": List all Fabric Sheet types
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FabricParamSheetType { get; }
Public Shared ReadOnly Property FabricParamSheetType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FabricParamSheetType {
	ForgeTypeId^ get ();
}
static member FabricParamSheetType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace